package MVC_SalesFramework;

public class Question {
/*

	2. 다음과 같은 메뉴로 동작하는 프로그램 작성

	   1. 품목 정보 등록
	   2. 판매 정보 등록
	   3. 판매 일람표 출력( 품목명순 )
	   4. 판매 일람표 출력( 판매금액순 )
	   0. 종료

	   * 품목 정보는 품목명, 단가, 판매수량, 판매 금액으로 구성
	   * 판매 정보는 품목명, 판매 수량으로 구성
	   * 품목 정보의 개수 제한은 없다.
	   * 판매 정보의 개수 제한은 없다.
	   * 판패 일람표는 다음과 같은 형태로 출력된다.


	-------------------------------------------------
	
			      <<< 판매 일람표 >>>
			      
	-------------------------------------------------
		품목명	단가		판매수량			판매금액
	-------------------------------------------------
		TV		5000	   5	   	 	 25000
		VTR		2000	   2	    	  4000
		CAMERA	1500	   5		      7500
	-------------------------------------------------	
							  총판매금액 :   36500
	-------------------------------------------------


	* 하나의 Java Project에 3~7번까지의 클래스를 작성하여 실습
	* 해당 Java Project를 본인 성함_날짜로 압축하여 제출
	
*/
}
